Revit 2017 API
AssetSet.IsEmpty Property
Test to see if the set is empty.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public virtual bool IsEmpty { get; }
Visual Basic
Public Overridable ReadOnly Property IsEmpty As Boolean
	Get
Visual C++
public:
virtual property bool IsEmpty {
	bool get ();
}
Remarks
If the set is empty then True will be returned, otherwise False.
See Also
AssetSet Class
Autodesk.Revit.Utility Namespace